/**************************************************************************
MODULE:    MCO
CONTAINS:  Main MicroCANopen implementation
COPYRIGHT: Embedded Systems Academy, Inc. 2002-2015.
           All rights reserved. www.microcanopen.com
DISCLAIM:  Read and understand our disclaimer before using this code!
           www.esacademy.com/disclaim.htm
           This software was written in accordance to the guidelines at
           www.esacademy.com/software/softwarestyleguide.pdf
LICENSE:   This file may be freely distributed.
VERSION:   6.20, ESA 11-MAY-15
           $LastChangedDate: 2015-05-09 19:41:45 -0300 (Sat, 09 May 2015) $
           $LastChangedRevision: 3390 $
***************************************************************************/ 


#ifndef _MCO_H
#define _MCO_H

#ifdef __cplusplus
extern "C" {
#endif


/**************************************************************************
Version Information, here V6.11
**************************************************************************/
#define _MCOPVERSION_ 6
#define _MCOSUBPVERSION_ 11

  
  // The following configuration files need to be supplied by the application
#include "nodecfg.h"
#include "procimg.h"


/**************************************************************************
ENSURE THAT IN REGARDS TO OPTIMIZATION THE DEFAULT CONFIGURATION IS USED, 
IF NOT SELECTED OTHERWISE in nodecfg.h
**************************************************************************/


#define IS_CAN_ID_HEARTBEAT(canid) ((canid >= 0x701) && (canid <= 0x77F))
#define IS_CAN_ID_SDOREQUEST(canid) (canid == 0x600+MY_NODE_ID)
#define IS_CAN_ID_SDORESPONSE(canid) (canid >= 0x581) && (canid <= 0x5FF)
#define CAN_ID_SDORESPONSE_FROM_RXID(canid) (canid - 0x80)
#define CAN_ID_SDOREQUEST(client_nodeid, server_nodeid)  ( 0x600 + server_nodeid )
#define CAN_ID_SDORESPONSE(client_nodeid, server_nodeid) ( 0x580 + server_nodeid )
#define SDOSERVER(tx_canid) 0

#endif

#endif


/**************************************************************************
SDO ABORT MESSAGES
**************************************************************************/
#define SDO_ABORT_TOGGLE          0x05030000UL
#define SDO_ABORT_UNKNOWN_COMMAND 0x05040001UL
#define SDO_ABORT_INVALID_SEQ     0x05040003UL
#define SDO_ABORT_CRC             0x05040004UL
#define SDO_ABORT_UNSUPPORTED     0x06010000UL
#define SDO_ABORT_WRITEONLY       0x06010001UL
#define SDO_ABORT_READONLY        0x06010002UL
#define SDO_ABORT_NOT_EXISTS      0x06020000UL
#define SDO_ABORT_PARAMETER       0x06040043UL
#define SDO_ABORT_TYPEMISMATCH    0x06070010UL
#define SDO_ABORT_DATATOBIG       0x06070012UL
#define SDO_ABORT_UNKNOWNSUB      0x06090011UL
#define SDO_ABORT_VALUE_RANGE     0x06090030UL
#define SDO_ABORT_VALUE_HIGH      0x06090031UL
#define SDO_ABORT_VALUE_LOW       0x06090032UL
#define SDO_ABORT_GENERAL         0x08000000UL
#define SDO_ABORT_TRANSFER        0x08000020UL
#define SDO_ABORT_NOTRANSFERCTRL  0x08000021UL
#define SDO_ABORT_NOTMAPPED       0x06040041UL
#define SDO_ABORT_MAPLENGTH       0x06040042UL


/**************************************************************************
Status bits for function MCOHW_GetStatus
**************************************************************************/
#define HW_INIT  0x01
#define HW_CERR  0x02
#define HW_ERPA  0x04
#define HW_RXOR  0x08
#define HW_TXOR  0x10
#define HW_TXBSY 0x40
#define HW_BOFF  0x80


/**************************************************************************
Defines for LED control
**************************************************************************/
#if USE_LEDS
// LED Flash Patterns
// Flickering directly implemented in lss.c
#define LED_OFF 0
#define LED_ON 0xFF
#define LED_BLINK 0x7F
// Single, double, triple and quadruple flashes
#define LED_FLASH1 1
#define LED_FLASH2 2
#define LED_FLASH3 3
#define LED_FLASH4 4
#endif // USE_LEDS


/**************************************************************************
States for Heartbeat Consumer handling 
**************************************************************************/
typedef enum {
  HBCONS_OFF,    // Disabled
  HBCONS_INIT,   // Initialized, waiting for second heartbeat
  HBCONS_ACTIVE, // Consumer active and OK
  HBCONS_LOST    // Heartbeat lost
} HBCONS_STATE;


/**************************************************************************
GLOBAL TYPE DEFINITIONS
**************************************************************************/

// Data structure for a single CAN message 
typedef struct
{ // order optimized for allignment
  UNSIGNED8 BUF[8];              // Data buffer 
  COBID_TYPE ID;                 // Message Identifier 
  UNSIGNED8 LEN;                 // Data length (0-8) 
} CAN_MSG;

// This structure holds all node specific configuration
typedef struct
{
  CAN_MSG heartbeat_msg;         // Heartbeat message contents
  UNSIGNED16 Baudrate;           // Current Baud rate in kbit
  UNSIGNED16 heartbeat_time;     // Heartbeat time in ms
  UNSIGNED16 heartbeat_timestamp;// Timestamp of last heartbeat
  UNSIGNED16 last_fatal;         // Last Fatal Error code
  UNSIGNED16 last_rxtime;        // Timestamp of last CAN receive
#if USE_SYNC
  UNSIGNED16 SYNCid;             // CAN ID used for SYNC
#endif
#if NR_OF_TPDOS > 255
  UNSIGNED16 nrTPDOs;
#else
 #if NR_OF_TPDOS > 0
  UNSIGNED8 nrTPDOs;
 #endif
#endif
#if NR_OF_RPDOS > 255
  UNSIGNED16 nrRPDOs;
#else
 #if NR_OF_RPDOS > 0
  UNSIGNED8 nrRPDOs;
 #endif
#endif
#if USE_LEDS
  UNSIGNED16 LED_timestamp;      // LED control timestamp
  UNSIGNED8 LEDtoggle;           // Toggler for blinking or flickering pattern
  UNSIGNED8 LEDRun;              // Current pattern on run led
  UNSIGNED8 LEDcntR;             // Current flash counter on run led
  UNSIGNED8 LEDErr;              // Current pattern on error led
  UNSIGNED8 LEDcntE;             // Current flash counter on error led
#endif // USE_LEDS
  UNSIGNED8 Node_ID;             // Current Node ID (1-126)
  UNSIGNED8 error_code;          // Bits: 0=RxQueue 1=TxQueue 3=CAN 7=first_op
  UNSIGNED8 error_register;      // Error regiter for OD entry [1001,00]
#if USE_NODE_GUARDING
  UNSIGNED8 NGtoggle;            // Toggle value for node guarding
#endif
  UNSIGNED8 HWStatus;            // CAN HW status
} MCO_CONFIG;

// Enumeration type for inhibit status
typedef enum
{
  INHITIM_EXPIRED,             // Inhibit timer not started or expired
  INHITIM_RUNNING_NO_TRIGGER,  // Inhibit timer started, not yet triggered for transmission
  INHITIM_RUNNING_TRIGGERED    // Transmit msg waiting for expiration of inhibit
} INHITIM_TYPE;

// This structure holds all the TPDO configuration data for one TPDO
typedef struct 
{
  CAN_MSG CAN;                 // Current/last CAN message to be transmitted
  UNSIGNED16 offset;           // Offest to application data in process image
  UNSIGNED16 PDONr;            // PDO number (1-512)
#if USE_EVENT_TIME
  UNSIGNED16 event_time;       // Event timer in ms (0 for COS only operation)
  UNSIGNED16 event_timestamp;  // If event timer is used, this is the 
                               // timestamp for the next transmission
#endif
#if USE_INHIBIT_TIME 
  UNSIGNED16 inhibit_time;     // Inhibit timer in ms (0 if COS not used)
  UNSIGNED16 inhibit_timestamp;// If inhibit timer is used, this is the 
                               // timestamp for the next transmission
  INHITIM_TYPE inhibit_status; // Status of inhibit timer
#endif
#if USE_SYNC
  UNSIGNED8 SYNCcnt;           // SYNC counter for counting SYNC signals
#endif
  UNSIGNED8 TType;             // Transmission Type
} TPDO_CONFIG;

// This structure holds all the RPDO configuration data for one RPDO
typedef struct 
{
#if USE_SYNC
  UNSIGNED8 BUF[8];  // SYNC data buffer 
#endif
  COBID_TYPE CANID;  // Message Identifier 
  UNSIGNED16 offset; // Pointer to destination of data 
  UNSIGNED16 PDONr;  // PDO number (1-512)
  UNSIGNED8 len;     // Data length (0-8) 
  UNSIGNED8 TType;   // Transmission Type
#if USECB_ODDATARECEIVED
  UNSIGNED16 map;    // offset to RPDO mapping in SDOResponseTable
#endif // USECB_ODDATARECEIVED
} RPDO_CONFIG;


/**************************************************************************
GLOBAL TYPES: Object Dictionary tables
**************************************************************************/
// This structure holds all data for one process data entry in the OD
typedef struct 
{
  UNSIGNED8 idx_lo;              // Index of OD entry
  UNSIGNED8 idx_hi;
  UNSIGNED8 subidx;              // Subindex of OD entry 
  UNSIGNED8 len;                 // Data length in bytes (1-4), plus bits ODRD, ODWR, RMAP/WMAP
  UNSIGNED8 off_lo;              // Offset to process data in process image
  UNSIGNED8 off_hi;
} OD_PROCESS_DATA_ENTRY;

#if USE_EXTENDED_SDO
// This structure holds all data for generic entries into the OD
typedef struct 
{
  UNSIGNED8 idx_lo;              // Index of OD entry
  UNSIGNED8 idx_hi;
  UNSIGNED8 subidx;              // Subindex of OD entry 
  UNSIGNED8 access;              // Bits ODRD, ODWR
  UNSIGNED8 len_lo;              // Length of data
  UNSIGNED8 len_hi;
#if USE_GENOD_PTR
  UNSIGNED8 *pDat;
#else
  UNSIGNED8 off_lo;              // Offset to process data in process image
  UNSIGNED8 off_hi;
#endif
} OD_GENERIC_DATA_ENTRY;
#endif // USE_EXTENDED_SDO


#if (INDEX_FOR_DIAGNOSTICS != 0)
/**************************************************************************
GLOBAL TYPES: Diagnostic Data Record
**************************************************************************/
typedef struct 
{ // Subindexes provided at Index INDEX_FOR_DIAGNOSTICS
                                    //  0: 22
                                    //  1: Identification (hard coded)
                                    //  2: Version (hard coded)
                                    //  3: Functionailty (hard coded)
  UNSIGNED32 Status;                //  4
#if (TXFIFOSIZE > 0)
  UNSIGNED32 TxFIFOStatus;          //  5: from lo to hi byte: FIFO size, max use, ovrflow count, 81 on ovrflow
#endif
#if (RXFIFOSIZE > 0)
  UNSIGNED32 RxFIFOStatus;          //  6: from lo to hi byte: FIFO size, max use, ovrflow count, 81 on ovrflow
#endif
#if (MGRFIFOSIZE > 0)
  UNSIGNED32 RxMgrFIFOStatus;       //  7: from lo to hi byte: FIFO size, max use, ovrflow count, 81 on ovrflow
#endif
  UNSIGNED16 ProcTickPerSecCur;     //  8
  UNSIGNED16 ProcTickPerSecMin;     //  9
  UNSIGNED16 ProcTickPerSecMax;     // 10
  UNSIGNED16 ProcTickBurstMax;      // 11
  UNSIGNED16 ProcRxPerSecCur;       // 12
  UNSIGNED16 ProcRxPerSecMin;       // 13
  UNSIGNED16 ProcRxPerSecMax;       // 14
                                    // 15: Reserved
#if MGR_MONITOR_ALL_NODES
  UNSIGNED16 ProcMgrTickPerSecCur;  // 16
  UNSIGNED16 ProcMgrTickPerSecMin;  // 17
  UNSIGNED16 ProcMgrTickPerSecMax;  // 18
  UNSIGNED16 ProcMgrTickBurstMax;   // 19
  UNSIGNED16 ProcMgrRxPerSecCur;    // 20
  UNSIGNED16 ProcMgrRxPerSecMin;    // 21
  UNSIGNED16 ProcMgrRxPerSecMax;    // 22
#endif
  // working variables
  UNSIGNED16 TickCnt;               // Counting calls to MCO_ProcessStackTick()
  UNSIGNED16 RxCnt;                 // Counting calls to MCO_ProcessStackRx()
  UNSIGNED16 BurstCnt;              // Counting retrun values of TRUE for MCO_ProcessStackTick()
  UNSIGNED16 NextSecond;            // Analyse diagnostics once per second
#if MGR_MONITOR_ALL_NODES
  UNSIGNED16 MgrTickCnt;
  UNSIGNED16 MgrRxCnt;
  UNSIGNED16 MgrBurstCnt;
  UNSIGNED16 MgrNextSecond;
#endif
} MCO_DIAGNOSTICS;
#endif

  
/**************************************************************************
GLOBAL VARIABLES
**************************************************************************/
// this structure holds all node specific configuration
extern MCO_CONFIG MEM_FAR gMCOConfig;

#if (INDEX_FOR_DIAGNOSTICS != 0)
// MCO diagnostics record
extern MCO_DIAGNOSTICS MEM_FAR gMCODiag;
#endif

